tap "genkiroid/cert"
tap "railwaycat/emacsmacport"
brew "bat"
brew "ripgrep"
brew "ast-grep"
brew "fd"
brew "byobu"
brew "cmake"
brew "curl"
brew "ffmpeg"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "imagemagick"
brew "iproute2mac"
brew "llvm"
brew "lv"
brew "pipenv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "uv"
brew "tkdiff"
brew "vim"
brew "zsh-completions"
brew "genkiroid/cert/cert"
brew "cmigemo"
brew "btop"
brew "gh"
brew "duckdb"
brew "direnv"
cask "emacs-mac"
cask "factor"
cask "meld"
cask "notion"
cask "docker-desktop"
