tap "genkiroid/cert"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask "emacs"
cask "meld"
cask "notion"
cask "xquartz"
cask "deepl"
cask "docker"
brew "bat"
brew "ripgrep"
brew "fd"
brew "bear"
brew "byobu"
brew "cmake"
brew "curl"
brew "ffmpeg"
brew "git"
brew "git-gui"
brew "git-lfs"
brew "imagemagick"
brew "iproute2mac"
brew "llvm"
brew "lv"
brew "openjdk"
brew "pipenv"
brew "pyenv"
brew "rtags"
brew "tkdiff"
brew "vim"
brew "zsh-completions"
brew "genkiroid/cert/cert"
brew "cmigemo"
brew "btop"
